In [95]:
import pandas as pd

In [96]:
data=[10,20,30,40]
s=pd.Series(data)
print(s)

0    10
1    20
2    30
3    40
dtype: int64

In [97]:
data=pd.Series([10,20,30,40,50],index=["a", "b", "c", "d","e"],name="numbers")
data
df=pd.DataFrame(data)
df

   numbers
a       10
b       20
c       30
d       40
e       50

In [98]:
data[3]

C:\Users\na499\AppData\Local\Temp\ipykernel_10812\977688468.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  data[3]

np.int64(40)

In [99]:
data1={
     "Name": ["Anish", "Rahul", "Sneha"],
    "Age": [21, 22, 20],
    "Marks": [85, 90, 88]
}
data1

{'Name': ['Anish', 'Rahul', 'Sneha'],
 'Age': [21, 22, 20],
 'Marks': [85, 90, 88]}

In [100]:
df=pd.DataFrame(data1)
df

    Name  Age  Marks
0  Anish   21     85
1  Rahul   22     90
2  Sneha   20     88

In [101]:
df=pd.read_csv("data.csv")
# pd.read_excel("filename with extinsion")
# pd.read_json("filename with extinsion")
df

    fruit   color  price  WEIGHT
0   mango  orange  500.0       3
1   mango  orange  500.0       3
2  banana  yellow  100.0       1
3   apple     red  600.0       5
4  orange  orange  100.0       2
5  grapes   green    NaN       1
6  sapota   brown  300.0      10

In [102]:
df.head(3)

    fruit   color  price  WEIGHT
0   mango  orange  500.0       3
1   mango  orange  500.0       3
2  banana  yellow  100.0       1

In [103]:
print(df.tail(13))
print("\n")
print(df.tail(3))

    fruit   color  price  WEIGHT
0   mango  orange  500.0       3
1   mango  orange  500.0       3
2  banana  yellow  100.0       1
3   apple     red  600.0       5
4  orange  orange  100.0       2
5  grapes   green    NaN       1
6  sapota   brown  300.0      10


    fruit   color  price  WEIGHT
4  orange  orange  100.0       2
5  grapes   green    NaN       1
6  sapota   brown  300.0      10

In [104]:
df.sample(3)

    fruit   color  price  WEIGHT
0   mango  orange  500.0       3
6  sapota   brown  300.0      10
3   apple     red  600.0       5

In [105]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   fruit   7 non-null      object
 1   color   7 non-null      object
 2   price   6 non-null      float64
 3   WEIGHT  7 non-null      int64
dtypes: float64(1), int64(1), object(2)
memory usage: 356.0+ bytes

In [106]:
print(df)
print("\n")
print(df.describe())

    fruit   color  price  WEIGHT
0   mango  orange  500.0       3
1   mango  orange  500.0       3
2  banana  yellow  100.0       1
3   apple     red  600.0       5
4  orange  orange  100.0       2
5  grapes   green    NaN       1
6  sapota   brown  300.0      10


            price     WEIGHT
count    6.000000   7.000000
mean   350.000000   3.571429
std    216.794834   3.154739
min    100.000000   1.000000
25%    150.000000   1.500000
50%    400.000000   3.000000
75%    500.000000   4.000000
max    600.000000  10.000000

In [107]:
df.shape

(7, 4)

In [108]:
df.columns

Index(['fruit', 'color', 'price', 'WEIGHT'], dtype='object')

In [109]:
df.dtypes

fruit      object
color      object
price     float64
WEIGHT      int64
dtype: object

In [110]:
df

    fruit   color  price  WEIGHT
0   mango  orange  500.0       3
1   mango  orange  500.0       3
2  banana  yellow  100.0       1
3   apple     red  600.0       5
4  orange  orange  100.0       2
5  grapes   green    NaN       1
6  sapota   brown  300.0      10

In [111]:
print(df["color"])
print("\n")
print(df["color"].shape)

0    orange
1    orange
2    yellow
3       red
4    orange
5     green
6     brown
Name: color, dtype: object


(7,)

In [112]:
df[["color","fruit","WEIGHT"]]

    color   fruit  WEIGHT
0  orange   mango       3
1  orange   mango       3
2  yellow  banana       1
3     red   apple       5
4  orange  orange       2
5   green  grapes       1
6   brown  sapota      10

In [113]:
df.loc[0:2]

    fruit   color  price  WEIGHT
0   mango  orange  500.0       3
1   mango  orange  500.0       3
2  banana  yellow  100.0       1

In [114]:
df.iloc[0:2]

   fruit   color  price  WEIGHT
0  mango  orange  500.0       3
1  mango  orange  500.0       3

In [115]:
df

    fruit   color  price  WEIGHT
0   mango  orange  500.0       3
1   mango  orange  500.0       3
2  banana  yellow  100.0       1
3   apple     red  600.0       5
4  orange  orange  100.0       2
5  grapes   green    NaN       1
6  sapota   brown  300.0      10

In [116]:
df[df["price"]>100]

    fruit   color  price  WEIGHT
0   mango  orange  500.0       3
1   mango  orange  500.0       3
3   apple     red  600.0       5
6  sapota   brown  300.0      10

In [117]:
df[df["WEIGHT"] < 10 ]

    fruit   color  price  WEIGHT
0   mango  orange  500.0       3
1   mango  orange  500.0       3
2  banana  yellow  100.0       1
3   apple     red  600.0       5
4  orange  orange  100.0       2
5  grapes   green    NaN       1

In [118]:
df[(df["WEIGHT"] <5) & (df["price"] > 300)]

   fruit   color  price  WEIGHT
0  mango  orange  500.0       3
1  mango  orange  500.0       3

In [119]:
df[(df["WEIGHT"] < 10) & (df["price"] == 100)]

    fruit   color  price  WEIGHT
2  banana  yellow  100.0       1
4  orange  orange  100.0       2

In [120]:
df["place"]=["karnataka","mumbai","kashmir","karnataka","kerala","delhi"]

ValueError: Length of values (6) does not match length of index (7)

In [ ]:
df

    fruit   color  price  WEIGHT      place
0   mango  orange  500.0       3  karnataka
1  banana  yellow  100.0       1     mumbai
2   apple     red  600.0       5    kashmir
3  orange  orange  100.0       2  karnataka
4  grapes   green    NaN       1     kerala
5  sapota   brown  300.0      10      delhi

In [ ]:
df["WEIGHT"] = df["WEIGHT"] + 1

In [ ]:
df

    fruit   color  price  WEIGHT      place
0   mango  orange  500.0       4  karnataka
1  banana  yellow  100.0       2     mumbai
2   apple     red  600.0       6    kashmir
3  orange  orange  100.0       3  karnataka
4  grapes   green    NaN       2     kerala
5  sapota   brown  300.0      11      delhi

In [ ]:
df.drop("WEIGHT",axis=1)

    fruit   color  price      place
0   mango  orange  500.0  karnataka
1  banana  yellow  100.0     mumbai
2   apple     red  600.0    kashmir
3  orange  orange  100.0  karnataka
4  grapes   green    NaN     kerala
5  sapota   brown  300.0      delhi

In [ ]:
df.drop("WEIGHT",axis=1,inplace=True)
df

    fruit   color  price      place
0   mango  orange  500.0  karnataka
1  banana  yellow  100.0     mumbai
2   apple     red  600.0    kashmir
3  orange  orange  100.0  karnataka
4  grapes   green    NaN     kerala
5  sapota   brown  300.0      delhi

In [ ]:
df.drop(2,axis=0)

    fruit   color  price      place
0   mango  orange  500.0  karnataka
1  banana  yellow  100.0     mumbai
3  orange  orange  100.0  karnataka
4  grapes   green    NaN     kerala
5  sapota   brown  300.0      delhi

In [ ]:
df.drop(2,axis=0,inplace=True)
df

    fruit   color  price      place
0   mango  orange  500.0  karnataka
1  banana  yellow  100.0     mumbai
3  orange  orange  100.0  karnataka
4  grapes   green    NaN     kerala
5  sapota   brown  300.0      delhi

In [ ]:
df.isnull()

   fruit  color  price  place
0  False  False  False  False
1  False  False  False  False
3  False  False  False  False
4  False  False   True  False
5  False  False  False  False

In [ ]:
df.isna()

   fruit  color  price  place
0  False  False  False  False
1  False  False  False  False
3  False  False  False  False
4  False  False   True  False
5  False  False  False  False

In [ ]:
df.isnull().value_counts()

fruit  color  price  place
False  False  False  False    4
              True   False    1
Name: count, dtype: int64

In [ ]:
df.isnull().sum()

fruit    0
color    0
price    1
place    0
dtype: int64

In [ ]:
df.fillna(df["price"].mean(),inplace=True)

In [ ]:

df.dropna()

    fruit   color  price      place
0   mango  orange  500.0  karnataka
1  banana  yellow  100.0     mumbai
3  orange  orange  100.0  karnataka
4  grapes   green  250.0     kerala
5  sapota   brown  300.0      delhi

In [ ]:
df

    fruit   color  price      place
0   mango  orange  500.0  karnataka
1  banana  yellow  100.0     mumbai
3  orange  orange  100.0  karnataka
4  grapes   green  250.0     kerala
5  sapota   brown  300.0      delhi

In [ ]:
df.dropna(inplace=True)

In [ ]:
df

    fruit   color  price      place
0   mango  orange  500.0  karnataka
1  banana  yellow  100.0     mumbai
3  orange  orange  100.0  karnataka
4  grapes   green  250.0     kerala
5  sapota   brown  300.0      delhi

In [ ]:
df.sort_values("price",ascending=True) #assending order of price

    fruit   color  price      place
1  banana  yellow  100.0     mumbai
3  orange  orange  100.0  karnataka
4  grapes   green  250.0     kerala
5  sapota   brown  300.0      delhi
0   mango  orange  500.0  karnataka

In [ ]:
df.sort_values("fruit",ascending=False) #descending order of alphabet

    fruit   color  price      place
5  sapota   brown  300.0      delhi
3  orange  orange  100.0  karnataka
0   mango  orange  500.0  karnataka
4  grapes   green  250.0     kerala
1  banana  yellow  100.0     mumbai

In [ ]:
df

    fruit   color  price      place
0   mango  orange  500.0  karnataka
1  banana  yellow  100.0     mumbai
3  orange  orange  100.0  karnataka
4  grapes   green  250.0     kerala
5  sapota   brown  300.0      delhi

In [ ]:
df.rename(columns={"color":"fruit color"},inplace=True)

In [ ]:
df

    fruit fruit color  price      place
0   mango      orange  500.0  karnataka
1  banana      yellow  100.0     mumbai
3  orange      orange  100.0  karnataka
4  grapes       green  250.0     kerala
5  sapota       brown  300.0      delhi

In [ ]:
df["price"] = df["price"].apply(lambda x: x + 1)

In [ ]:
df["price"]

0    501.0
1    101.0
3    101.0
4    251.0
5    301.0
Name: price, dtype: float64

In [ ]:
df

    fruit fruit color  price      place
0   mango      orange  501.0  karnataka
1  banana      yellow  101.0     mumbai
3  orange      orange  101.0  karnataka
4  grapes       green  251.0     kerala
5  sapota       brown  301.0      delhi

In [ ]:
df1 = pd.DataFrame({
    "ID": [1,2,3],
    "Name": ["A","B","C"]
})

df2 = pd.DataFrame({
    "ID": [1,2,4],
    "Marks": [90,85,88]
})

In [ ]:
df.shape

(5, 4)

In [ ]:
df1.shape

(3, 2)

In [ ]:
df2.shape

(3, 2)

In [ ]:
pd.concat([df1, df])

    ID Name   fruit fruit color  price      place
0  1.0    A     NaN         NaN    NaN        NaN
1  2.0    B     NaN         NaN    NaN        NaN
2  3.0    C     NaN         NaN    NaN        NaN
0  NaN  NaN   mango      orange  501.0  karnataka
1  NaN  NaN  banana      yellow  101.0     mumbai
3  NaN  NaN  orange      orange  101.0  karnataka
4  NaN  NaN  grapes       green  251.0     kerala
5  NaN  NaN  sapota       brown  301.0      delhi

In [ ]:
pd.merge(df1,df2)

   ID Name  Marks
0   1    A     90
1   2    B     85

In [ ]:
df["color"].value_counts()

color
orange    3
yellow    1
red       1
green     1
brown     1
Name: count, dtype: int64

In [ ]:
df

    fruit   color  price  WEIGHT
0   mango  orange  500.0       3
1   mango  orange  500.0       3
2  banana  yellow  100.0       1
3   apple     red  600.0       5
4  orange  orange  100.0       2
5  grapes   green    NaN       1
6  sapota   brown  300.0      10

In [ ]:
df.duplicated()

0    False
1     True
2    False
3    False
4    False
5    False
6    False
dtype: bool

In [ ]:
df.drop_duplicates(inplace=True)

In [ ]:
df

    fruit   color  price  WEIGHT
0   mango  orange  500.0       3
2  banana  yellow  100.0       1
3   apple     red  600.0       5
4  orange  orange  100.0       2
5  grapes   green    NaN       1
6  sapota   brown  300.0      10

In [ ]:
df["color"]=df["color"].str.upper()

In [ ]:
df

    fruit   color  price  WEIGHT
0   mango  ORANGE  500.0       3
2  banana  YELLOW  100.0       1
3   apple     RED  600.0       5
4  orange  ORANGE  100.0       2
5  grapes   GREEN    NaN       1
6  sapota   BROWN  300.0      10

In [ ]:
datedata={
    "name":["anish","rohit","mahesh"],"date":["2025-05-13","2001-07-20","2018-12-26"]
}
df4=pd.DataFrame(datedata)
df4

     name        date
0   anish  2025-05-13
1   rohit  2001-07-20
2  mahesh  2018-12-26

In [ ]:
df4["Date"]=pd.to_datetime(df4["date"]) #changes the attribute from string to date 
df4

     name       date       Date
0   anish 2025-05-13 2025-05-13
1   rohit 2001-07-20 2001-07-20
2  mahesh 2018-12-26 2018-12-26

In [ ]:
df4["year"]=df4["Date"].dt.year
df4

     name       date       Date  year
0   anish 2025-05-13 2025-05-13  2025
1   rohit 2001-07-20 2001-07-20  2001
2  mahesh 2018-12-26 2018-12-26  2018

In [ ]:
df4["Month"]=df4["Date"].dt.month
df4

     name       date       Date  year  Month
0   anish 2025-05-13 2025-05-13  2025      5
1   rohit 2001-07-20 2001-07-20  2001      7
2  mahesh 2018-12-26 2018-12-26  2018     12

In [122]:
df.fillna(df["price"].mean(),inplace=True)
df

    fruit   color  price  WEIGHT
0   mango  orange  500.0       3
1   mango  orange  500.0       3
2  banana  yellow  100.0       1
3   apple     red  600.0       5
4  orange  orange  100.0       2
5  grapes   green  350.0       1
6  sapota   brown  300.0      10

In [ ]:
# df.to_csv("newdata.csv",index=False)
# df.to_excel("newdata.xlsx",index=False)
# df.to_json("newdata.json",index=False)